*** funera_core/src/env.rs:162:13: delete field tool_registry from struct Self expression in FuneraEnv::with_tool_registry

*** mutation diff:
--- funera_core/src/env.rs
+++ delete field tool_registry from struct Self expression in FuneraEnv::with_tool_registry
@@ -154,17 +154,17 @@
         &self.sandbox_policy
     }
 
     #[cfg(feature = "tool")]
     pub fn with_tool_registry(self, tool_registry: ToolRegistry) -> Self {
         let snapshot = tool_registry.available_tools_json();
         let _ = self.tool_tx.send(snapshot);
         Self {
-            tool_registry: Arc::new(RwLock::new(tool_registry)),
+             /* ~ changed by cargo-mutants ~ */
             ..self
         }
     }
 
     #[cfg(feature = "skill")]
     pub fn with_skill_registry(self, skill_registry: SkillRegistry) -> Self {
         let prompt = skill_registry.get_active_skills_prompt();
         let _ = self.skill_tx.send(prompt);

*** result: Success
