*** funera_core/src/env.rs:154:9: replace FuneraEnv::sandbox_policy -> &SandboxPolicy with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::sandbox_policy -> &SandboxPolicy with Box::leak(Box::new(Default::default()))
@@ -146,17 +146,17 @@
     pub fn with_sandbox_policy(mut self, policy: SandboxPolicy) -> Self {
         self.sandbox_policy = policy;
         self
     }
 
     /// The configured sandbox policy.
     #[cfg(feature = "sandbox")]
     pub fn sandbox_policy(&self) -> &SandboxPolicy {
-        &self.sandbox_policy
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "tool")]
     pub fn with_tool_registry(self, tool_registry: ToolRegistry) -> Self {
         let snapshot = tool_registry.available_tools_json();
         let _ = self.tool_tx.send(snapshot);
         Self {
             tool_registry: Arc::new(RwLock::new(tool_registry)),

---- env::tests::with_sandbox_policy_roundtrips stdout ----

thread 'env::tests::with_sandbox_policy_roundtrips' (29104) panicked at funera_core\src\env.rs:573:9:
assertion failed: !env.sandbox_policy().enabled

failures:
    env::tests::with_sandbox_policy_roundtrips

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
