*** funera_core/src/env.rs:172:13: delete field skill_registry from struct Self expression in FuneraEnv::with_skill_registry

*** mutation diff:
--- funera_core/src/env.rs
+++ delete field skill_registry from struct Self expression in FuneraEnv::with_skill_registry
@@ -164,17 +164,17 @@
         }
     }
 
     #[cfg(feature = "skill")]
     pub fn with_skill_registry(self, skill_registry: SkillRegistry) -> Self {
         let prompt = skill_registry.get_active_skills_prompt();
         let _ = self.skill_tx.send(prompt);
         Self {
-            skill_registry: Arc::new(RwLock::new(skill_registry)),
+             /* ~ changed by cargo-mutants ~ */
             ..self
         }
     }
 
     #[cfg(feature = "tool")]
     pub(crate) async fn add_tool(&mut self, tool: Box<dyn Tool>) {
         let mut registry = self.tool_registry.write().await;
         registry.add_tool(tool);

*** result: Success
