*** funera_core/src/env.rs:179:9: replace FuneraEnv::add_tool with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::add_tool with ()
@@ -171,19 +171,17 @@
         Self {
             skill_registry: Arc::new(RwLock::new(skill_registry)),
             ..self
         }
     }
 
     #[cfg(feature = "tool")]
     pub(crate) async fn add_tool(&mut self, tool: Box<dyn Tool>) {
-        let mut registry = self.tool_registry.write().await;
-        registry.add_tool(tool);
-        let _ = self.tool_tx.send(registry.available_tools_json());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "tool")]
     pub(crate) async fn remove_tool(&mut self, name: &str) {
         let mut registry = self.tool_registry.write().await;
         registry.remove_tool(name);
         let _ = self.tool_tx.send(registry.available_tools_json());
     }

---- env::tests::tool_tests::add_then_remove_tool_updates_watcher stdout ----

thread 'env::tests::tool_tests::add_then_remove_tool_updates_watcher' (27196) panicked at funera_core\src\env.rs:613:13:
assertion failed: watcher.watch_tool().as_array().is_some_and(|a| a.len() == 1)

---- env::tests::tool_tests::tool_changed_awaits_change stdout ----

thread 'env::tests::tool_tests::tool_changed_awaits_change' (33252) panicked at funera_core\src\env.rs:653:13:
tool_changed should resolve after add_tool

failures:
    env::tests::tool_tests::add_then_remove_tool_updates_watcher
    env::tests::tool_tests::tool_changed_awaits_change

test result: FAILED. 182 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.01s

*** result: Failure(101)
