*** funera_core/src/env.rs:186:9: replace FuneraEnv::remove_tool with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::remove_tool with ()
@@ -178,19 +178,17 @@
     pub(crate) async fn add_tool(&mut self, tool: Box<dyn Tool>) {
         let mut registry = self.tool_registry.write().await;
         registry.add_tool(tool);
         let _ = self.tool_tx.send(registry.available_tools_json());
     }
 
     #[cfg(feature = "tool")]
     pub(crate) async fn remove_tool(&mut self, name: &str) {
-        let mut registry = self.tool_registry.write().await;
-        registry.remove_tool(name);
-        let _ = self.tool_tx.send(registry.available_tools_json());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "tool")]
     pub(crate) async fn set_tool_availability(&mut self, _name: &str, _available: bool) {
         let registry = self.tool_registry.read().await;
         let _ = self.tool_tx.send(registry.available_tools_json());
     }

---- env::tests::tool_tests::add_then_remove_tool_updates_watcher stdout ----

thread 'env::tests::tool_tests::add_then_remove_tool_updates_watcher' (12864) panicked at funera_core\src\env.rs:615:13:
assertion failed: watcher.watch_tool().as_array().is_some_and(|a| a.is_empty())

failures:
    env::tests::tool_tests::add_then_remove_tool_updates_watcher

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
