*** funera_core/src/env.rs:193:9: replace FuneraEnv::set_tool_availability with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::set_tool_availability with ()
@@ -185,18 +185,17 @@
     pub(crate) async fn remove_tool(&mut self, name: &str) {
         let mut registry = self.tool_registry.write().await;
         registry.remove_tool(name);
         let _ = self.tool_tx.send(registry.available_tools_json());
     }
 
     #[cfg(feature = "tool")]
     pub(crate) async fn set_tool_availability(&mut self, _name: &str, _available: bool) {
-        let registry = self.tool_registry.read().await;
-        let _ = self.tool_tx.send(registry.available_tools_json());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn set_client(&mut self, client: async_openai::Client<OpenAIConfig>) {
         self.llm_client = client.clone();
         let _ = self.client_tx.send(client);
     }
 
     pub(crate) fn set_model(&mut self, model: impl Into<String>) {

---- env::tests::tool_tests::set_tool_availability_rebroadcasts_snapshot stdout ----

thread 'env::tests::tool_tests::set_tool_availability_rebroadcasts_snapshot' (33632) panicked at funera_core\src\env.rs:626:13:
assertion failed: watcher.has_tool_changed()

failures:
    env::tests::tool_tests::set_tool_availability_rebroadcasts_snapshot

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
