*** funera_core/src/env.rs:198:9: replace FuneraEnv::set_client with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::set_client with ()
@@ -190,18 +190,17 @@
 
     #[cfg(feature = "tool")]
     pub(crate) async fn set_tool_availability(&mut self, _name: &str, _available: bool) {
         let registry = self.tool_registry.read().await;
         let _ = self.tool_tx.send(registry.available_tools_json());
     }
 
     pub(crate) fn set_client(&mut self, client: async_openai::Client<OpenAIConfig>) {
-        self.llm_client = client.clone();
-        let _ = self.client_tx.send(client);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn set_model(&mut self, model: impl Into<String>) {
         let model = model.into();
         self.model = model.clone();
         let _ = self.model_tx.send(model);
     }

---- env::tests::set_client_marks_client_changed stdout ----

thread 'env::tests::set_client_marks_client_changed' (46188) panicked at funera_core\src\env.rs:521:9:
assertion failed: watcher.has_client_changed()

---- env::tests::client_changed_awaits_change stdout ----

thread 'env::tests::client_changed_awaits_change' (46304) panicked at funera_core\src\env.rs:560:9:
client_changed should resolve after set_client

failures:
    env::tests::client_changed_awaits_change
    env::tests::set_client_marks_client_changed

test result: FAILED. 182 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.02s

*** result: Failure(101)
