*** funera_core/src/env.rs:203:9: replace FuneraEnv::set_model with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::set_model with ()
@@ -195,19 +195,17 @@
     }
 
     pub(crate) fn set_client(&mut self, client: async_openai::Client<OpenAIConfig>) {
         self.llm_client = client.clone();
         let _ = self.client_tx.send(client);
     }
 
     pub(crate) fn set_model(&mut self, model: impl Into<String>) {
-        let model = model.into();
-        self.model = model.clone();
-        let _ = self.model_tx.send(model);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "skill")]
     pub(crate) async fn add_skill(&mut self, skill: Skill) {
         let mut registry = self.skill_registry.write().await;
         registry.add(skill);
         let _ = self.skill_tx.send(registry.get_active_skills_prompt());
     }

---- env::tests::set_model_updates_model_and_watcher stdout ----

thread 'env::tests::set_model_updates_model_and_watcher' (21160) panicked at funera_core\src\env.rs:501:9:
assertion `left == right` failed
  left: "test-model"
 right: "m2"

---- env::tests::has_model_changed_reflects_changes stdout ----

thread 'env::tests::has_model_changed_reflects_changes' (25272) panicked at funera_core\src\env.rs:510:9:
assertion failed: watcher.has_model_changed()

---- env::tests::model_changed_awaits_change stdout ----

thread 'env::tests::model_changed_awaits_change' (9656) panicked at funera_core\src\env.rs:538:9:
model_changed should resolve after set_model

failures:
    env::tests::has_model_changed_reflects_changes
    env::tests::model_changed_awaits_change
    env::tests::set_model_updates_model_and_watcher

test result: FAILED. 181 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.01s

*** result: Failure(101)
