*** funera_core/src/env.rs:210:9: replace FuneraEnv::add_skill with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::add_skill with ()
@@ -202,19 +202,17 @@
     pub(crate) fn set_model(&mut self, model: impl Into<String>) {
         let model = model.into();
         self.model = model.clone();
         let _ = self.model_tx.send(model);
     }
 
     #[cfg(feature = "skill")]
     pub(crate) async fn add_skill(&mut self, skill: Skill) {
-        let mut registry = self.skill_registry.write().await;
-        registry.add(skill);
-        let _ = self.skill_tx.send(registry.get_active_skills_prompt());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "skill")]
     pub(crate) async fn remove_skill(&mut self, name: &str) {
         let mut registry = self.skill_registry.write().await;
         registry.remove(name);
         let _ = self.skill_tx.send(registry.get_active_skills_prompt());
     }

---- env::tests::skill_tests::activate_deactivate_skill_returns_bool stdout ----

thread 'env::tests::skill_tests::activate_deactivate_skill_returns_bool' (33396) panicked at funera_core\src\env.rs:681:13:
assertion failed: env.activate_skill("s1").await

---- env::tests::skill_tests::add_and_activate_skill_updates_prompt stdout ----

thread 'env::tests::skill_tests::add_and_activate_skill_updates_prompt' (12376) panicked at funera_core\src\env.rs:671:13:
assertion failed: env.activate_skill("s1").await

---- env::tests::skill_tests::skill_changed_awaits_change stdout ----

thread 'env::tests::skill_tests::skill_changed_awaits_change' (33600) panicked at funera_core\src\env.rs:729:13:
skill_changed should resolve after add_skill

failures:
    env::tests::skill_tests::activate_deactivate_skill_returns_bool
    env::tests::skill_tests::add_and_activate_skill_updates_prompt
    env::tests::skill_tests::skill_changed_awaits_change

test result: FAILED. 181 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.01s

*** result: Failure(101)
