*** funera_core/src/env.rs:224:9: replace FuneraEnv::activate_skill -> bool with true

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::activate_skill -> bool with true
@@ -216,22 +216,17 @@
     pub(crate) async fn remove_skill(&mut self, name: &str) {
         let mut registry = self.skill_registry.write().await;
         registry.remove(name);
         let _ = self.skill_tx.send(registry.get_active_skills_prompt());
     }
 
     #[cfg(feature = "skill")]
     pub(crate) async fn activate_skill(&mut self, name: &str) -> bool {
-        let mut registry = self.skill_registry.write().await;
-        let ok = registry.activate(name);
-        if ok {
-            let _ = self.skill_tx.send(registry.get_active_skills_prompt());
-        }
-        ok
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "skill")]
     pub(crate) async fn deactivate_skill(&mut self, name: &str) -> bool {
         let mut registry = self.skill_registry.write().await;
         let ok = registry.deactivate(name);
         if ok {
             let _ = self.skill_tx.send(registry.get_active_skills_prompt());

---- env::tests::skill_tests::add_and_activate_skill_updates_prompt stdout ----

thread 'env::tests::skill_tests::add_and_activate_skill_updates_prompt' (24812) panicked at funera_core\src\env.rs:669:13:
assertion `left == right` failed
  left: ""
 right: "part one"

---- env::tests::skill_tests::activate_deactivate_skill_returns_bool stdout ----

thread 'env::tests::skill_tests::activate_deactivate_skill_returns_bool' (12704) panicked at funera_core\src\env.rs:677:13:
assertion failed: !env.activate_skill("ghost").await

---- security::sandbox_win::tests::test_fallback_without_network_block stdout ----

thread 'security::sandbox_win::tests::test_fallback_without_network_block' (8772) panicked at /rustc/8bab26f4f68e0e26f0bb7960be334d5b520ea452/library\std\src\sys\thread\windows.rs:66:13:
failed to join on thread: 句柄无效。 (os error 6)

failures:
    env::tests::skill_tests::activate_deactivate_skill_returns_bool
    env::tests::skill_tests::add_and_activate_skill_updates_prompt
    security::sandbox_win::tests::test_fallback_without_network_block

test result: FAILED. 181 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
