*** funera_core/src/env.rs:224:9: replace FuneraEnv::activate_skill -> bool with false

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::activate_skill -> bool with false
@@ -216,22 +216,17 @@
     pub(crate) async fn remove_skill(&mut self, name: &str) {
         let mut registry = self.skill_registry.write().await;
         registry.remove(name);
         let _ = self.skill_tx.send(registry.get_active_skills_prompt());
     }
 
     #[cfg(feature = "skill")]
     pub(crate) async fn activate_skill(&mut self, name: &str) -> bool {
-        let mut registry = self.skill_registry.write().await;
-        let ok = registry.activate(name);
-        if ok {
-            let _ = self.skill_tx.send(registry.get_active_skills_prompt());
-        }
-        ok
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "skill")]
     pub(crate) async fn deactivate_skill(&mut self, name: &str) -> bool {
         let mut registry = self.skill_registry.write().await;
         let ok = registry.deactivate(name);
         if ok {
             let _ = self.skill_tx.send(registry.get_active_skills_prompt());

---- env::tests::skill_tests::add_and_activate_skill_updates_prompt stdout ----

thread 'env::tests::skill_tests::add_and_activate_skill_updates_prompt' (37384) panicked at funera_core\src\env.rs:668:13:
assertion failed: env.activate_skill("s1").await

---- env::tests::skill_tests::activate_deactivate_skill_returns_bool stdout ----

thread 'env::tests::skill_tests::activate_deactivate_skill_returns_bool' (11376) panicked at funera_core\src\env.rs:678:13:
assertion failed: env.activate_skill("s1").await

failures:
    env::tests::skill_tests::activate_deactivate_skill_returns_bool
    env::tests::skill_tests::add_and_activate_skill_updates_prompt

test result: FAILED. 182 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
