*** funera_core/src/env.rs:234:9: replace FuneraEnv::deactivate_skill -> bool with true

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::deactivate_skill -> bool with true
@@ -226,22 +226,17 @@
         if ok {
             let _ = self.skill_tx.send(registry.get_active_skills_prompt());
         }
         ok
     }
 
     #[cfg(feature = "skill")]
     pub(crate) async fn deactivate_skill(&mut self, name: &str) -> bool {
-        let mut registry = self.skill_registry.write().await;
-        let ok = registry.deactivate(name);
-        if ok {
-            let _ = self.skill_tx.send(registry.get_active_skills_prompt());
-        }
-        ok
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "skill")]
     pub(crate) fn skill_prompt_now(&self) -> String {
         self.skill_tx.borrow().clone()
     }
 
     #[cfg(feature = "skill")]

---- env::tests::skill_tests::activate_deactivate_skill_returns_bool stdout ----

thread 'env::tests::skill_tests::activate_deactivate_skill_returns_bool' (44264) panicked at funera_core\src\env.rs:681:13:
assertion `left == right` failed
  left: "content"
 right: ""

failures:
    env::tests::skill_tests::activate_deactivate_skill_returns_bool

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
