*** funera_core/src/env.rs:244:9: replace FuneraEnv::skill_prompt_now -> String with "xyzzy".into()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::skill_prompt_now -> String with "xyzzy".into()
@@ -236,17 +236,17 @@
         if ok {
             let _ = self.skill_tx.send(registry.get_active_skills_prompt());
         }
         ok
     }
 
     #[cfg(feature = "skill")]
     pub(crate) fn skill_prompt_now(&self) -> String {
-        self.skill_tx.borrow().clone()
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "skill")]
     pub(crate) fn set_skill_prompt(&mut self, prompt: String) {
         let _ = self.skill_tx.send(prompt);
     }
 
     pub(crate) fn model(&self) -> &str {

---- env::tests::skill_tests::add_and_activate_skill_updates_prompt stdout ----

thread 'env::tests::skill_tests::add_and_activate_skill_updates_prompt' (2732) panicked at funera_core\src\env.rs:675:13:
assertion `left == right` failed
  left: "xyzzy"
 right: "part one"

failures:
    env::tests::skill_tests::add_and_activate_skill_updates_prompt

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
