*** funera_core/src/env.rs:249:9: replace FuneraEnv::set_skill_prompt with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::set_skill_prompt with ()
@@ -241,17 +241,17 @@
 
     #[cfg(feature = "skill")]
     pub(crate) fn skill_prompt_now(&self) -> String {
         self.skill_tx.borrow().clone()
     }
 
     #[cfg(feature = "skill")]
     pub(crate) fn set_skill_prompt(&mut self, prompt: String) {
-        let _ = self.skill_tx.send(prompt);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn model(&self) -> &str {
         &self.model
     }
 }
 
 #[derive(Debug, Clone)]

---- env::tests::skill_tests::set_skill_prompt_and_has_changed stdout ----

thread 'env::tests::skill_tests::set_skill_prompt_and_has_changed' (23260) panicked at funera_core\src\env.rs:714:13:
assertion failed: watcher.has_skill_changed()

failures:
    env::tests::skill_tests::set_skill_prompt_and_has_changed

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
