*** funera_core/src/env.rs:253:9: replace FuneraEnv::model -> &str with ""

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::model -> &str with ""
@@ -245,17 +245,17 @@
     }
 
     #[cfg(feature = "skill")]
     pub(crate) fn set_skill_prompt(&mut self, prompt: String) {
         let _ = self.skill_tx.send(prompt);
     }
 
     pub(crate) fn model(&self) -> &str {
-        &self.model
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone)]
 pub struct FuneraEnvWatcher {
     #[cfg(feature = "tool")]
     tool_rx: watch::Receiver<JsonValue>,
     client_rx: watch::Receiver<async_openai::Client<OpenAIConfig>>,

---- env::tests::set_model_updates_model_and_watcher stdout ----

thread 'env::tests::set_model_updates_model_and_watcher' (22464) panicked at funera_core\src\env.rs:501:9:
assertion `left == right` failed
  left: ""
 right: "test-model"

failures:
    env::tests::set_model_updates_model_and_watcher

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
