*** funera_core/src/env.rs:270:9: replace FuneraEnvWatcher::watch_tool -> JsonValue with Default::default()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnvWatcher::watch_tool -> JsonValue with Default::default()
@@ -262,17 +262,17 @@
     model_rx: watch::Receiver<String>,
     #[cfg(feature = "skill")]
     skill_rx: watch::Receiver<String>,
 }
 
 impl FuneraEnvWatcher {
     #[cfg(feature = "tool")]
     pub fn watch_tool(&mut self) -> JsonValue {
-        self.tool_rx.borrow_and_update().clone()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn watch_client(&mut self) -> async_openai::Client<OpenAIConfig> {
         self.client_rx.borrow_and_update().clone()
     }
 
     pub fn watch_model(&mut self) -> String {
         self.model_rx.borrow_and_update().clone()

---- env::tests::tool_tests::has_tool_changed_reflects_changes stdout ----

thread 'env::tests::tool_tests::has_tool_changed_reflects_changes' (35088) panicked at funera_core\src\env.rs:639:13:
assertion failed: !watcher.has_tool_changed()

---- env::tests::tool_tests::set_tool_availability_rebroadcasts_snapshot stdout ----

thread 'env::tests::tool_tests::set_tool_availability_rebroadcasts_snapshot' (27248) panicked at funera_core\src\env.rs:625:13:
assertion failed: !watcher.has_tool_changed()

---- env::tests::tool_tests::with_tool_registry_updates_watcher stdout ----

thread 'env::tests::tool_tests::with_tool_registry_updates_watcher' (24408) panicked at funera_core\src\env.rs:608:13:
assertion failed: watcher.watch_tool().as_array().is_some_and(|a| a.len() == 1)

failures:
    env::tests::tool_tests::add_then_remove_tool_updates_watcher
    env::tests::tool_tests::has_tool_changed_reflects_changes
    env::tests::tool_tests::set_tool_availability_rebroadcasts_snapshot
    env::tests::tool_tests::with_tool_registry_updates_watcher

test result: FAILED. 180 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
