*** funera_core/src/env.rs:278:9: replace FuneraEnvWatcher::watch_model -> String with String::new()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnvWatcher::watch_model -> String with String::new()
@@ -270,17 +270,17 @@
         self.tool_rx.borrow_and_update().clone()
     }
 
     pub fn watch_client(&mut self) -> async_openai::Client<OpenAIConfig> {
         self.client_rx.borrow_and_update().clone()
     }
 
     pub fn watch_model(&mut self) -> String {
-        self.model_rx.borrow_and_update().clone()
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "skill")]
     pub fn watch_skill(&mut self) -> String {
         self.skill_rx.borrow_and_update().clone()
     }
 
     #[cfg(feature = "tool")]

---- env::tests::set_model_updates_model_and_watcher stdout ----

thread 'env::tests::set_model_updates_model_and_watcher' (43448) panicked at funera_core\src\env.rs:504:9:
assertion `left == right` failed
  left: ""
 right: "m2"

---- env::tests::has_model_changed_reflects_changes stdout ----

thread 'env::tests::has_model_changed_reflects_changes' (37468) panicked at funera_core\src\env.rs:514:9:
assertion failed: !watcher.has_model_changed()

---- env::tests::model_changed_awaits_change stdout ----

thread 'env::tests::model_changed_awaits_change' (45220) panicked at funera_core\src\env.rs:544:9:
assertion `left == right` failed
  left: ""
 right: "m2"

failures:
    env::tests::has_model_changed_reflects_changes
    env::tests::model_changed_awaits_change
    env::tests::set_model_updates_model_and_watcher

test result: FAILED. 181 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
