*** funera_core/src/env.rs:283:9: replace FuneraEnvWatcher::watch_skill -> String with String::new()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnvWatcher::watch_skill -> String with String::new()
@@ -275,17 +275,17 @@
     }
 
     pub fn watch_model(&mut self) -> String {
         self.model_rx.borrow_and_update().clone()
     }
 
     #[cfg(feature = "skill")]
     pub fn watch_skill(&mut self) -> String {
-        self.skill_rx.borrow_and_update().clone()
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "tool")]
     pub fn has_tool_changed(&self) -> bool {
         self.tool_rx.has_changed().unwrap_or(false)
     }
 
     pub fn has_client_changed(&self) -> bool {

---- env::tests::skill_tests::set_skill_prompt_and_has_changed stdout ----

thread 'env::tests::skill_tests::set_skill_prompt_and_has_changed' (7292) panicked at funera_core\src\env.rs:715:13:
assertion `left == right` failed
  left: ""
 right: "hello"

---- env::tests::skill_tests::with_skill_registry_updates_watcher stdout ----

thread 'env::tests::skill_tests::with_skill_registry_updates_watcher' (40556) panicked at funera_core\src\env.rs:706:13:
assertion `left == right` failed
  left: ""
 right: "content"

---- env::tests::skill_tests::activate_deactivate_skill_returns_bool stdout ----

thread 'env::tests::skill_tests::activate_deactivate_skill_returns_bool' (27056) panicked at funera_core\src\env.rs:684:13:
assertion `left == right` failed
  left: ""
 right: "content"

failures:
    env::tests::skill_tests::activate_deactivate_skill_returns_bool
    env::tests::skill_tests::add_and_activate_skill_updates_prompt
    env::tests::skill_tests::set_skill_prompt_and_has_changed
    env::tests::skill_tests::with_skill_registry_updates_watcher

test result: FAILED. 180 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
