*** funera_core/src/env.rs:288:9: replace FuneraEnvWatcher::has_tool_changed -> bool with true

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnvWatcher::has_tool_changed -> bool with true
@@ -280,17 +280,17 @@
 
     #[cfg(feature = "skill")]
     pub fn watch_skill(&mut self) -> String {
         self.skill_rx.borrow_and_update().clone()
     }
 
     #[cfg(feature = "tool")]
     pub fn has_tool_changed(&self) -> bool {
-        self.tool_rx.has_changed().unwrap_or(false)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn has_client_changed(&self) -> bool {
         self.client_rx.has_changed().unwrap_or(false)
     }
 
     pub fn has_model_changed(&self) -> bool {
         self.model_rx.has_changed().unwrap_or(false)

---- env::tests::tool_tests::has_tool_changed_reflects_changes stdout ----

thread 'env::tests::tool_tests::has_tool_changed_reflects_changes' (29272) panicked at funera_core\src\env.rs:633:13:
assertion failed: !watcher.has_tool_changed()

---- env::tests::tool_tests::set_tool_availability_rebroadcasts_snapshot stdout ----

thread 'env::tests::tool_tests::set_tool_availability_rebroadcasts_snapshot' (8072) panicked at funera_core\src\env.rs:625:13:
assertion failed: !watcher.has_tool_changed()

failures:
    env::tests::tool_tests::has_tool_changed_reflects_changes
    env::tests::tool_tests::set_tool_availability_rebroadcasts_snapshot

test result: FAILED. 182 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
