*** funera_core/src/env.rs:292:9: replace FuneraEnvWatcher::has_client_changed -> bool with false

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnvWatcher::has_client_changed -> bool with false
@@ -284,17 +284,17 @@
     }
 
     #[cfg(feature = "tool")]
     pub fn has_tool_changed(&self) -> bool {
         self.tool_rx.has_changed().unwrap_or(false)
     }
 
     pub fn has_client_changed(&self) -> bool {
-        self.client_rx.has_changed().unwrap_or(false)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn has_model_changed(&self) -> bool {
         self.model_rx.has_changed().unwrap_or(false)
     }
 
     #[cfg(feature = "skill")]
     pub fn has_skill_changed(&self) -> bool {

---- env::tests::set_client_marks_client_changed stdout ----

thread 'env::tests::set_client_marks_client_changed' (17336) panicked at funera_core\src\env.rs:522:9:
assertion failed: watcher.has_client_changed()

failures:
    env::tests::set_client_marks_client_changed

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
