*** funera_core/src/env.rs:296:9: replace FuneraEnvWatcher::has_model_changed -> bool with true

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnvWatcher::has_model_changed -> bool with true
@@ -288,17 +288,17 @@
         self.tool_rx.has_changed().unwrap_or(false)
     }
 
     pub fn has_client_changed(&self) -> bool {
         self.client_rx.has_changed().unwrap_or(false)
     }
 
     pub fn has_model_changed(&self) -> bool {
-        self.model_rx.has_changed().unwrap_or(false)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "skill")]
     pub fn has_skill_changed(&self) -> bool {
         self.skill_rx.has_changed().unwrap_or(false)
     }
 
     pub fn use_client(&mut self) -> async_openai::Client<OpenAIConfig> {

---- env::tests::has_model_changed_reflects_changes stdout ----

thread 'env::tests::has_model_changed_reflects_changes' (5360) panicked at funera_core\src\env.rs:510:9:
assertion failed: !watcher.has_model_changed()

failures:
    env::tests::has_model_changed_reflects_changes

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
