*** funera_core/src/env.rs:301:9: replace FuneraEnvWatcher::has_skill_changed -> bool with true

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnvWatcher::has_skill_changed -> bool with true
@@ -293,17 +293,17 @@
     }
 
     pub fn has_model_changed(&self) -> bool {
         self.model_rx.has_changed().unwrap_or(false)
     }
 
     #[cfg(feature = "skill")]
     pub fn has_skill_changed(&self) -> bool {
-        self.skill_rx.has_changed().unwrap_or(false)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn use_client(&mut self) -> async_openai::Client<OpenAIConfig> {
         self.watch_client()
     }
 
     #[cfg(feature = "tool")]
     pub async fn tool_changed(&mut self) -> Result<(), RecvError> {

---- env::tests::skill_tests::set_skill_prompt_and_has_changed stdout ----

thread 'env::tests::skill_tests::set_skill_prompt_and_has_changed' (39228) panicked at funera_core\src\env.rs:712:13:
assertion failed: !watcher.has_skill_changed()

failures:
    env::tests::skill_tests::set_skill_prompt_and_has_changed

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
