*** funera_core/src/env.rs:318:9: replace FuneraEnvWatcher::model_changed -> Result<(), RecvError> with Ok(())

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnvWatcher::model_changed -> Result<(), RecvError> with Ok(())
@@ -310,17 +310,17 @@
         self.tool_rx.changed().await
     }
 
     pub async fn client_changed(&mut self) -> Result<(), RecvError> {
         self.client_rx.changed().await
     }
 
     pub async fn model_changed(&mut self) -> Result<(), RecvError> {
-        self.model_rx.changed().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(feature = "skill")]
     pub async fn skill_changed(&mut self) -> Result<(), RecvError> {
         self.skill_rx.changed().await
     }
 }

---- env::tests::model_changed_awaits_change stdout ----

thread 'env::tests::model_changed_awaits_change' (31824) panicked at funera_core\src\env.rs:544:9:
assertion `left == right` failed
  left: "test-model"
 right: "m2"

failures:
    env::tests::model_changed_awaits_change

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
