*** funera_core/src/env.rs:323:9: replace FuneraEnvWatcher::skill_changed -> Result<(), RecvError> with Ok(())

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnvWatcher::skill_changed -> Result<(), RecvError> with Ok(())
@@ -315,17 +315,17 @@
     }
 
     pub async fn model_changed(&mut self) -> Result<(), RecvError> {
         self.model_rx.changed().await
     }
 
     #[cfg(feature = "skill")]
     pub async fn skill_changed(&mut self) -> Result<(), RecvError> {
-        self.skill_rx.changed().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ═══════════════════════════════════════════════════════════════
 // Capability layer — reversible effects + typed services
 // ═══════════════════════════════════════════════════════════════
 
 impl FuneraEnv {

*** result: Success
