*** funera_core/src/env.rs:349:9: replace FuneraEnv::on_service_change with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::on_service_change with ()
@@ -341,17 +341,17 @@
         child
     }
 
     /// Subscribe to service provision/removal events.
     ///
     /// The observer is called with `(TypeId, true)` when a service is provided
     /// and `(TypeId, false)` when it is removed.
     pub fn on_service_change(&self, observer: ServiceObserver) {
-        self.shared.subscribe(observer);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Register a reversible effect.
     ///
     /// `body` runs now (setup) and returns a [`Disposer`] that undoes it. The
     /// disposer is pushed onto the env's accumulator and run in reverse (LIFO)
     /// order by [`dispose`](Self::dispose) when the env is torn down.
     ///

---- plugin::tests::service_change_observer_fires_on_provide_and_remove stdout ----

thread 'plugin::tests::service_change_observer_fires_on_provide_and_remove' (19324) panicked at funera_core\src\plugin.rs:459:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    plugin::tests::service_change_observer_fires_on_provide_and_remove

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
