*** funera_core/src/env.rs:365:9: replace FuneraEnv::effect with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::effect with ()
@@ -357,18 +357,17 @@
     ///
     /// ```rust,ignore
     /// env.effect(|| {
     ///     let resource = acquire();       // setup: the effect
     ///     Box::new(move || release(resource))  // teardown: its inverse
     /// });
     /// ```
     pub fn effect(&self, body: impl FnOnce() -> Disposer) {
-        let undo = body();
-        self.disposers.lock().unwrap().push(undo);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Provide a typed service to this env.
     ///
     /// The service is stored under its [`TypeId`] and automatically removed on
     /// [`dispose`](Self::dispose). `provide` is itself an effect: its inverse is
     /// "remove the service", registered in this env's own accumulator.
     ///

---- env::tests::provide_get_roundtrip stdout ----

thread 'env::tests::provide_get_roundtrip' (37684) panicked at funera_core\src\env.rs:449:9:
assertion failed: env.contains::<Config>()

---- env::tests::effect_runs_in_lifo_order stdout ----

thread 'env::tests::effect_runs_in_lifo_order' (35784) panicked at funera_core\src\env.rs:482:9:
assertion `left == right` failed
  left: []
 right: ["second", "first"]

---- env::tests::provide_removed_on_dispose stdout ----

thread 'env::tests::provide_removed_on_dispose' (29204) panicked at funera_core\src\env.rs:464:9:
assertion failed: env.contains::<String>()

failures:
    env::tests::effect_runs_in_lifo_order
    env::tests::provide_get_roundtrip
    env::tests::provide_removed_on_dispose
    loader::tests::reload_reverts_old_effects
    plugin::tests::provider_satisfies_dependent
    plugin::tests::removing_provider_deactivates_dependent
    plugin::tests::service_change_observer_fires_on_provide_and_remove
    plugin::tests::unmount_reverts_effects

test result: FAILED. 176 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
