*** funera_core/src/env.rs:382:9: replace FuneraEnv::provide with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::provide with ()
@@ -374,25 +374,17 @@
     ///
     /// ```rust,ignore
     /// #[derive(Clone)]
     /// struct Config { url: String }
     /// env.provide(Config { url: "db://…".into() });
     /// let cfg: std::sync::Arc<Config> = env.get::<Config>().unwrap();
     /// ```
     pub fn provide<T: Send + Sync + 'static>(&self, value: T) {
-        let key = TypeId::of::<T>();
-        let shared = Arc::clone(&self.shared);
-        self.effect(move || {
-            shared.insert(key, Arc::new(value));
-            let teardown_shared = Arc::clone(&shared);
-            Box::new(move || {
-                teardown_shared.remove(key);
-            })
-        });
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolve a typed service previously provided to this env (or a parent).
     pub fn get<T: Send + Sync + 'static>(&self) -> Option<Arc<T>> {
         self.shared
             .services
             .read()
             .unwrap()

---- env::tests::provide_removed_on_dispose stdout ----

thread 'env::tests::provide_removed_on_dispose' (24688) panicked at funera_core\src\env.rs:457:9:
assertion failed: env.contains::<String>()

---- env::tests::provide_get_roundtrip stdout ----

thread 'env::tests::provide_get_roundtrip' (2752) panicked at funera_core\src\env.rs:442:9:
assertion failed: env.contains::<Config>()

---- plugin::tests::removing_provider_deactivates_dependent stdout ----

thread 'plugin::tests::removing_provider_deactivates_dependent' (41244) panicked at funera_core\src\plugin.rs:376:9:
assertion `left == right` failed
  left: Some(Pending)
 right: Some(Active)

failures:
    env::tests::provide_get_roundtrip
    env::tests::provide_removed_on_dispose
    plugin::tests::provider_satisfies_dependent
    plugin::tests::removing_provider_deactivates_dependent
    plugin::tests::service_change_observer_fires_on_provide_and_remove

test result: FAILED. 179 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
