*** funera_core/src/env.rs:395:9: replace FuneraEnv::get -> Option<Arc<T>> with None

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::get -> Option<Arc<T>> with None
@@ -387,22 +387,17 @@
             Box::new(move || {
                 teardown_shared.remove(key);
             })
         });
     }
 
     /// Resolve a typed service previously provided to this env (or a parent).
     pub fn get<T: Send + Sync + 'static>(&self) -> Option<Arc<T>> {
-        self.shared
-            .services
-            .read()
-            .unwrap()
-            .get(&TypeId::of::<T>())
-            .and_then(|v| v.clone().downcast::<T>().ok())
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether a service of type `T` is currently provided.
     pub fn contains<T: Send + Sync + 'static>(&self) -> bool {
         self.contains_typeid(TypeId::of::<T>())
     }
 
     /// Whether a service with the given [`TypeId`] is currently provided.

---- env::tests::provide_get_roundtrip stdout ----

thread 'env::tests::provide_get_roundtrip' (4392) panicked at funera_core\src\env.rs:447:40:
called `Option::unwrap()` on a `None` value

failures:
    env::tests::provide_get_roundtrip

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
