*** funera_core/src/env.rs:405:9: replace FuneraEnv::contains -> bool with true

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::contains -> bool with true
@@ -397,17 +397,17 @@
             .read()
             .unwrap()
             .get(&TypeId::of::<T>())
             .and_then(|v| v.clone().downcast::<T>().ok())
     }
 
     /// Whether a service of type `T` is currently provided.
     pub fn contains<T: Send + Sync + 'static>(&self) -> bool {
-        self.contains_typeid(TypeId::of::<T>())
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether a service with the given [`TypeId`] is currently provided.
     ///
     /// The non-generic counterpart of [`contains`](Self::contains), used by the
     /// plugin registry to check `inject` requirements (which are [`TypeId`]s).
     pub fn contains_typeid(&self, key: TypeId) -> bool {
         self.shared.services.read().unwrap().contains_key(&key)

---- env::tests::provide_removed_on_dispose stdout ----

thread 'env::tests::provide_removed_on_dispose' (16440) panicked at funera_core\src\env.rs:468:9:
assertion failed: !env.contains::<String>()

---- plugin::tests::failed_apply_rolls_back_and_marks_failed stdout ----

thread 'plugin::tests::failed_apply_rolls_back_and_marks_failed' (39764) panicked at funera_core\src\plugin.rs:440:9:
partial effects must be rolled back

---- plugin::tests::removing_provider_deactivates_dependent stdout ----

thread 'plugin::tests::removing_provider_deactivates_dependent' (44692) panicked at funera_core\src\plugin.rs:380:9:
deactivation must revert the dependent's provided services

failures:
    env::tests::provide_removed_on_dispose
    plugin::tests::failed_apply_rolls_back_and_marks_failed
    plugin::tests::removing_provider_deactivates_dependent
    security::sandbox_win::tests::test_fallback_timeout

test result: FAILED. 180 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
