*** funera_core/src/env.rs:405:9: replace FuneraEnv::contains -> bool with false

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::contains -> bool with false
@@ -397,17 +397,17 @@
             .read()
             .unwrap()
             .get(&TypeId::of::<T>())
             .and_then(|v| v.clone().downcast::<T>().ok())
     }
 
     /// Whether a service of type `T` is currently provided.
     pub fn contains<T: Send + Sync + 'static>(&self) -> bool {
-        self.contains_typeid(TypeId::of::<T>())
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether a service with the given [`TypeId`] is currently provided.
     ///
     /// The non-generic counterpart of [`contains`](Self::contains), used by the
     /// plugin registry to check `inject` requirements (which are [`TypeId`]s).
     pub fn contains_typeid(&self, key: TypeId) -> bool {
         self.shared.services.read().unwrap().contains_key(&key)

---- env::tests::provide_removed_on_dispose stdout ----

thread 'env::tests::provide_removed_on_dispose' (41116) panicked at funera_core\src\env.rs:465:9:
assertion failed: env.contains::<String>()

---- env::tests::provide_get_roundtrip stdout ----

thread 'env::tests::provide_get_roundtrip' (42812) panicked at funera_core\src\env.rs:450:9:
assertion failed: env.contains::<Config>()

---- plugin::tests::provider_satisfies_dependent stdout ----

thread 'plugin::tests::provider_satisfies_dependent' (21708) panicked at funera_core\src\plugin.rs:342:13:
apply must run only once ServiceA is present

failures:
    env::tests::provide_get_roundtrip
    env::tests::provide_removed_on_dispose
    plugin::tests::provider_satisfies_dependent
    plugin::tests::removing_provider_deactivates_dependent

test result: FAILED. 180 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
