*** funera_core/src/env.rs:413:9: replace FuneraEnv::contains_typeid -> bool with true

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::contains_typeid -> bool with true
@@ -405,17 +405,17 @@
         self.contains_typeid(TypeId::of::<T>())
     }
 
     /// Whether a service with the given [`TypeId`] is currently provided.
     ///
     /// The non-generic counterpart of [`contains`](Self::contains), used by the
     /// plugin registry to check `inject` requirements (which are [`TypeId`]s).
     pub fn contains_typeid(&self, key: TypeId) -> bool {
-        self.shared.services.read().unwrap().contains_key(&key)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Number of services currently provided.
     pub fn service_count(&self) -> usize {
         self.shared.services.read().unwrap().len()
     }
 
     /// Run every registered disposer in reverse (LIFO) order.

---- env::tests::provide_removed_on_dispose stdout ----

thread 'env::tests::provide_removed_on_dispose' (40588) panicked at funera_core\src\env.rs:468:9:
assertion failed: !env.contains::<String>()

---- plugin::tests::failed_apply_rolls_back_and_marks_failed stdout ----

thread 'plugin::tests::failed_apply_rolls_back_and_marks_failed' (11424) panicked at funera_core\src\plugin.rs:440:9:
partial effects must be rolled back

---- plugin::tests::mount_without_deps_stays_pending stdout ----

thread 'plugin::tests::mount_without_deps_stays_pending' (42616) panicked at funera_core\src\plugin.rs:356:9:
assertion `left == right` failed
  left: Some(Active)
 right: Some(Pending)

failures:
    env::tests::provide_removed_on_dispose
    plugin::tests::failed_apply_rolls_back_and_marks_failed
    plugin::tests::mount_without_deps_stays_pending
    plugin::tests::removing_provider_deactivates_dependent

test result: FAILED. 180 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
