*** funera_core/src/env.rs:413:9: replace FuneraEnv::contains_typeid -> bool with false

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::contains_typeid -> bool with false
@@ -405,17 +405,17 @@
         self.contains_typeid(TypeId::of::<T>())
     }
 
     /// Whether a service with the given [`TypeId`] is currently provided.
     ///
     /// The non-generic counterpart of [`contains`](Self::contains), used by the
     /// plugin registry to check `inject` requirements (which are [`TypeId`]s).
     pub fn contains_typeid(&self, key: TypeId) -> bool {
-        self.shared.services.read().unwrap().contains_key(&key)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Number of services currently provided.
     pub fn service_count(&self) -> usize {
         self.shared.services.read().unwrap().len()
     }
 
     /// Run every registered disposer in reverse (LIFO) order.

---- env::tests::provide_get_roundtrip stdout ----

thread 'env::tests::provide_get_roundtrip' (36844) panicked at funera_core\src\env.rs:450:9:
assertion failed: env.contains::<Config>()

---- env::tests::provide_removed_on_dispose stdout ----

thread 'env::tests::provide_removed_on_dispose' (35848) panicked at funera_core\src\env.rs:465:9:
assertion failed: env.contains::<String>()

---- plugin::tests::provider_satisfies_dependent stdout ----

thread 'plugin::tests::provider_satisfies_dependent' (33244) panicked at funera_core\src\plugin.rs:366:9:
assertion `left == right` failed
  left: Some(Pending)
 right: Some(Active)

failures:
    env::tests::provide_get_roundtrip
    env::tests::provide_removed_on_dispose
    plugin::tests::provider_satisfies_dependent
    plugin::tests::removing_provider_deactivates_dependent

test result: FAILED. 180 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
