*** funera_core/src/env.rs:418:9: replace FuneraEnv::service_count -> usize with 1

*** mutation diff:
--- funera_core/src/env.rs
+++ replace FuneraEnv::service_count -> usize with 1
@@ -410,17 +410,17 @@
     /// The non-generic counterpart of [`contains`](Self::contains), used by the
     /// plugin registry to check `inject` requirements (which are [`TypeId`]s).
     pub fn contains_typeid(&self, key: TypeId) -> bool {
         self.shared.services.read().unwrap().contains_key(&key)
     }
 
     /// Number of services currently provided.
     pub fn service_count(&self) -> usize {
-        self.shared.services.read().unwrap().len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Run every registered disposer in reverse (LIFO) order.
     ///
     /// This tears the env's capability layer down: each effect is undone in the
     /// reverse of the order it was registered. Only this env's own effects are
     /// reverted; services provided by sibling envs are untouched.
     pub fn dispose(&self) {

---- env::tests::provide_removed_on_dispose stdout ----

thread 'env::tests::provide_removed_on_dispose' (36104) panicked at funera_core\src\env.rs:469:9:
assertion `left == right` failed
  left: 1
 right: 0

---- env::tests::dispose_idempotent stdout ----

thread 'env::tests::dispose_idempotent' (14588) panicked at funera_core\src\env.rs:493:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    env::tests::dispose_idempotent
    env::tests::provide_removed_on_dispose

test result: FAILED. 182 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
