*** funera_core/src/env.rs:52:9: replace EnvShared::insert with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace EnvShared::insert with ()
@@ -44,18 +44,17 @@
     fn new() -> Self {
         Self {
             services: StdRwLock::new(HashMap::new()),
             observers: Mutex::new(Vec::new()),
         }
     }
 
     fn insert(&self, key: TypeId, value: Arc<dyn Any + Send + Sync>) {
-        self.services.write().unwrap().insert(key, value);
-        self.notify(key, true);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn remove(&self, key: TypeId) {
         self.services.write().unwrap().remove(&key);
         self.notify(key, false);
     }
 
     fn notify(&self, key: TypeId, present: bool) {

---- env::tests::provide_get_roundtrip stdout ----

thread 'env::tests::provide_get_roundtrip' (31424) panicked at funera_core\src\env.rs:449:9:
assertion failed: env.contains::<Config>()

---- env::tests::provide_removed_on_dispose stdout ----

thread 'env::tests::provide_removed_on_dispose' (2432) panicked at funera_core\src\env.rs:464:9:
assertion failed: env.contains::<String>()

---- plugin::tests::provider_satisfies_dependent stdout ----

thread 'plugin::tests::provider_satisfies_dependent' (34172) panicked at funera_core\src\plugin.rs:366:9:
assertion `left == right` failed
  left: Some(Pending)
 right: Some(Active)

failures:
    env::tests::provide_get_roundtrip
    env::tests::provide_removed_on_dispose
    plugin::tests::provider_satisfies_dependent
    plugin::tests::removing_provider_deactivates_dependent
    plugin::tests::service_change_observer_fires_on_provide_and_remove

test result: FAILED. 179 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
