*** funera_core/src/env.rs:57:9: replace EnvShared::remove with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace EnvShared::remove with ()
@@ -49,18 +49,17 @@
     }
 
     fn insert(&self, key: TypeId, value: Arc<dyn Any + Send + Sync>) {
         self.services.write().unwrap().insert(key, value);
         self.notify(key, true);
     }
 
     fn remove(&self, key: TypeId) {
-        self.services.write().unwrap().remove(&key);
-        self.notify(key, false);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn notify(&self, key: TypeId, present: bool) {
         let observers = self.observers.lock().unwrap();
         for observer in observers.iter() {
             observer(key, present);
         }
     }

---- env::tests::provide_removed_on_dispose stdout ----

thread 'env::tests::provide_removed_on_dispose' (35152) panicked at funera_core\src\env.rs:467:9:
assertion failed: !env.contains::<String>()

---- plugin::tests::failed_apply_rolls_back_and_marks_failed stdout ----

thread 'plugin::tests::failed_apply_rolls_back_and_marks_failed' (44616) panicked at funera_core\src\plugin.rs:440:9:
partial effects must be rolled back

---- plugin::tests::removing_provider_deactivates_dependent stdout ----

thread 'plugin::tests::removing_provider_deactivates_dependent' (34928) panicked at funera_core\src\plugin.rs:379:9:
assertion `left == right` failed
  left: Some(Active)
 right: Some(Pending)

failures:
    env::tests::provide_removed_on_dispose
    plugin::tests::failed_apply_rolls_back_and_marks_failed
    plugin::tests::removing_provider_deactivates_dependent
    plugin::tests::service_change_observer_fires_on_provide_and_remove

test result: FAILED. 180 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
