*** funera_core/src/env.rs:62:9: replace EnvShared::notify with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace EnvShared::notify with ()
@@ -54,20 +54,17 @@
     }
 
     fn remove(&self, key: TypeId) {
         self.services.write().unwrap().remove(&key);
         self.notify(key, false);
     }
 
     fn notify(&self, key: TypeId, present: bool) {
-        let observers = self.observers.lock().unwrap();
-        for observer in observers.iter() {
-            observer(key, present);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn subscribe(&self, observer: ServiceObserver) {
         self.observers.lock().unwrap().push(observer);
     }
 }
 
 #[derive(Clone)]

---- plugin::tests::service_change_observer_fires_on_provide_and_remove stdout ----

thread 'plugin::tests::service_change_observer_fires_on_provide_and_remove' (41408) panicked at funera_core\src\plugin.rs:459:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    plugin::tests::service_change_observer_fires_on_provide_and_remove

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
