*** funera_core/src/env.rs:69:9: replace EnvShared::subscribe with ()

*** mutation diff:
--- funera_core/src/env.rs
+++ replace EnvShared::subscribe with ()
@@ -61,17 +61,17 @@
     fn notify(&self, key: TypeId, present: bool) {
         let observers = self.observers.lock().unwrap();
         for observer in observers.iter() {
             observer(key, present);
         }
     }
 
     fn subscribe(&self, observer: ServiceObserver) {
-        self.observers.lock().unwrap().push(observer);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone)]
 pub struct FuneraEnv {
     #[cfg(feature = "tool")]
     pub(crate) tool_registry: Arc<RwLock<ToolRegistry>>,
     #[cfg(feature = "skill")]

---- plugin::tests::service_change_observer_fires_on_provide_and_remove stdout ----

thread 'plugin::tests::service_change_observer_fires_on_provide_and_remove' (19288) panicked at funera_core\src\plugin.rs:459:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    plugin::tests::service_change_observer_fires_on_provide_and_remove

test result: FAILED. 183 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
